Revit 2024 API
ParameterTypeId.StructConnectionColumnBase Property
 "Base Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructConnectionColumnBase { get; }
Visual Basic
Public Shared ReadOnly Property StructConnectionColumnBase As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructConnectionColumnBase {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace